In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
# Drop columns
ufo.drop(['City', 'Colors Reported'], axis=1, inplace=True)

In [5]:
ufo.head()

  Shape Reported State             Time
0       TRIANGLE    NY   6/1/1930 22:00
1          OTHER    NJ  6/30/1930 20:00
2           OVAL    CO  2/15/1931 14:00
3           DISK    KS   6/1/1931 13:00
4          LIGHT    NY  4/18/1933 19:00

In [6]:
# The index proprty gives a tuple of indexes
ufo[ufo['State'] == 'NJ'].index.shape

(370,)

In [7]:
# Drop a list of rows, by using the index tuple
ufo.drop(ufo[ufo['State'].isin(('NY', 'NJ', 'CO'))].index, axis=0, inplace=True)
ufo

      Shape Reported State              Time
3               DISK    KS    6/1/1931 13:00
5               DISK    ND   9/15/1934 15:30
6             CIRCLE    CA    6/15/1935 0:00
7               DISK    MI    7/15/1936 0:00
8              CIGAR    AK  10/15/1936 17:00
...              ...   ...               ...
18236       TRIANGLE    IL  12/31/2000 23:00
18237           DISK    IA  12/31/2000 23:00
18238            NaN    WI  12/31/2000 23:45
18239          LIGHT    WI  12/31/2000 23:45
18240           OVAL    FL  12/31/2000 23:59

[16590 rows x 3 columns]